app/controllers/songs_controller.rb

  def new
    if params[:artist_id]
      if Artist.exists?(id: params[:artist_id])
---
SELECT "artists".* FROM "artists"

  def edit
    if params[:artist_id]
      if Artist.exists?(id: params[:artist_id])
        @artist = Artist.find_by(id: params[:artist_id])
        if @artist.songs.include?(Song.find(params[:id]))
---
SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 4]]

  def update
    @song = Song.find(params[:id])

    @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "songs" SET "title" = ?, "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "1)  new pixies song from songs/new; 2) then updated from songs/id/edit"], ["artist_id", 6], ["updated_at", "2017-10-24 13:30:16.558607"], ["id", 21]]